In [2]:
import pandas as pd

In [3]:
data = {'state' : ['Ker','Ker','Ker','Kar','Kar'],
       'year' : [2000,2001,2002,2001,2002],
       'pop' : [1.5,1.7,3.6,2.4,2.9]
       }
print(type(data))
print(data)

<class 'dict'>
{'state': ['Ker', 'Ker', 'Ker', 'Kar', 'Kar'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [4]:
frame = pd.DataFrame(data)
print(frame)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [5]:
print(type(frame))

<class 'pandas.core.frame.DataFrame'>

In [6]:
print(frame)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [8]:
#Retrieve one column
print(frame['state'])

0    Ker
1    Ker
2    Ker
3    Kar
4    Kar
Name: state, dtype: object

In [9]:
print(frame.state)

0    Ker
1    Ker
2    Ker
3    Kar
4    Kar
Name: state, dtype: object

In [10]:
#Retrieve multiple columns
print(frame[['state','pop']])

  state  pop
0   Ker  1.5
1   Ker  1.7
2   Ker  3.6
3   Kar  2.4
4   Kar  2.9

In [12]:
#Retrieve one row
#loc = location
print(frame.loc[1])

state     Ker
year     2001
pop       1.7
Name: 1, dtype: object

In [13]:
#Retrieve multiple rows
print(frame.loc[[1,3]])

  state  year  pop
1   Ker  2001  1.7
3   Kar  2001  2.4

In [17]:
#if you pass a column that isn't contained in data,
#it will appear with NaN values in the result:
frame2 = pd.DataFrame(data,
                     columns = ['year','state','pop','debt'],
                     index = ['one','two','three','four','five'])
print(frame2)

       year state  pop debt
one    2000   Ker  1.5  NaN
two    2001   Ker  1.7  NaN
three  2002   Ker  3.6  NaN
four   2001   Kar  2.4  NaN
five   2002   Kar  2.9  NaN

In [16]:
#Retrieving DataFrame values using dict-like notation
print(frame['state'])

0    Ker
1    Ker
2    Ker
3    Kar
4    Kar
Name: state, dtype: object

In [18]:
#Retrieving DataFrame values using attribute notation
print(frame.state)

0    Ker
1    Ker
2    Ker
3    Kar
4    Kar
Name: state, dtype: object

In [20]:
#loc index field-location
print(frame)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [21]:
print(frame.loc[3])

state     Kar
year     2001
pop       2.4
Name: 3, dtype: object

In [27]:
import numpy as np
info = {
    'Name' : ['Nithesh','Pawan','Ronith','Preetham'],
    'Age' : [20,17,20,18],
    'RollNo' : [33,34,1,40],
    'Martial Status' : [np.NaN,np.NaN,np.NaN,np.NaN]
}
frame3 = pd.DataFrame(info)
print(frame3)

       Name  Age  RollNo  Martial Status
0   Nithesh   20      33             NaN
1     Pawan   17      34             NaN
2    Ronith   20       1             NaN
3  Preetham   18      40             NaN

In [31]:
print(frame3.isnull())

    Name    Age  RollNo  Martial Status
0  False  False   False            True
1  False  False   False            True
2  False  False   False            True
3  False  False   False            True

In [29]:
print(frame3.isnull().sum())

Name              0
Age               0
RollNo            0
Martial Status    4
dtype: int64

In [36]:
print(frame3)

       Name  Age  RollNo  Martial Status
0   Nithesh   20      33             NaN
1     Pawan   17      34             NaN
2    Ronith   20       1             NaN
3  Preetham   18      40             NaN

In [37]:
c1 = frame3.dropna() #row
print(c1)

Empty DataFrame
Columns: [Name, Age, RollNo, Martial Status]
Index: []

In [39]:
c2 = frame3.dropna(axis = 1) #column
print(c2)

       Name  Age  RollNo
0   Nithesh   20      33
1     Pawan   17      34
2    Ronith   20       1
3  Preetham   18      40

In [40]:
d1 = frame2.dropna(axis = 1)
print(d1)

       year state  pop
one    2000   Ker  1.5
two    2001   Ker  1.7
three  2002   Ker  3.6
four   2001   Kar  2.4
five   2002   Kar  2.9

In [41]:
d2 = frame2.dropna(axis = 1, how = 'all')
print(d2)

       year state  pop
one    2000   Ker  1.5
two    2001   Ker  1.7
three  2002   Ker  3.6
four   2001   Kar  2.4
five   2002   Kar  2.9

In [44]:
#Filling missing data
print(frame)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [47]:
e1 = frame.fillna(0)
print(e1)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [48]:
print(frame)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [49]:
#Calling fillna with a dict you can use a different fill value for each column:
print(frame)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9

In [51]:
e2 = frame.fillna({1: 0.5,2: -1})
print(e2)
print(data)

  state  year  pop
0   Ker  2000  1.5
1   Ker  2001  1.7
2   Ker  2002  3.6
3   Kar  2001  2.4
4   Kar  2002  2.9
{'state': ['Ker', 'Ker', 'Ker', 'Kar', 'Kar'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [1]:
import numpy as np

In [8]:
dict = {
    "Subjects" : ['Math','Eng','Hindi','Kan','Science'],
    "S1" : [30,np.NaN,56,66,67],
    "S2" : [30,77,np.NaN,66,67],
    "S3" : [80,np.NaN,86,96,67],
    "S4" : [30,77,56,66,np.NaN],
}
df = pd.DataFrame(dict)
df

  Subjects    S1    S2    S3    S4
0     Math  30.0  30.0  80.0  30.0
1      Eng   NaN  77.0   NaN  77.0
2    Hindi  56.0   NaN  86.0  56.0
3      Kan  66.0  66.0  96.0  66.0
4  Science  67.0  67.0  67.0   NaN

In [9]:
df.isnull()

   Subjects     S1     S2     S3     S4
0     False  False  False  False  False
1     False   True  False   True  False
2     False  False   True  False  False
3     False  False  False  False  False
4     False  False  False  False   True

In [10]:
df.isnull().sum()

Subjects    0
S1          1
S2          1
S3          1
S4          1
dtype: int64

In [14]:
#filling the null values using with mean
df['S1'].fillna(df['S1'].mean(),inplace = True)
df['S2'].fillna(df['S2'].mean(),inplace = True)
df['S3'].fillna(df['S3'].mean(),inplace = True)
df['S4'].fillna(df['S4'].mean(),inplace = True)
df

  Subjects     S1    S2     S3     S4
0     Math  30.00  30.0  80.00  30.00
1      Eng  54.75  77.0  82.25  77.00
2    Hindi  56.00  60.0  86.00  56.00
3      Kan  66.00  66.0  96.00  66.00
4  Science  67.00  67.0  67.00  57.25

In [16]:
#filling the null values using with median
df['S2'].fillna(df['S2'].median(),inplace = True)

In [18]:
#we will create a dict,value for each key as a series
dict = {
    "one" : pd.Series([1,2,3,4,5],index = ['a','b','c','d','e']),
    "two" : pd.Series([1,2,3,4,5],index = ['a','b','c','d','e']),
    "three" : pd.Series([1,2,3,4,5,6],index = ['a','b','c','d','e','f']),
    }
df = pd.DataFrame(dict)
df

   one  two  three
a  1.0  1.0      1
b  2.0  2.0      2
c  3.0  3.0      3
d  4.0  4.0      4
e  5.0  5.0      5
f  NaN  NaN      6

In [20]:
#To add one more column for data frame,value should be series
df["four"]= pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
df

   one  two  three  four
a  1.0  1.0      1   1.0
b  2.0  2.0      2   2.0
c  3.0  3.0      3   3.0
d  4.0  4.0      4   4.0
e  5.0  5.0      5   5.0
f  NaN  NaN      6   NaN

In [26]:
#To add one more column,whose value should sum of two column
df['five'] = df['one'] + df['three']
df

   one  two  three  four  five
a  1.0  1.0      1   1.0   2.0
b  2.0  2.0      2   2.0   4.0
c  3.0  3.0      3   3.0   6.0
d  4.0  4.0      4   4.0   8.0
e  5.0  5.0      5   5.0  10.0
f  NaN  NaN      6   NaN   NaN

In [27]:
#Deleting column by using del keyword
del df['five']
df

   one  two  three  four
a  1.0  1.0      1   1.0
b  2.0  2.0      2   2.0
c  3.0  3.0      3   3.0
d  4.0  4.0      4   4.0
e  5.0  5.0      5   5.0
f  NaN  NaN      6   NaN

In [28]:
#Dropping multiple columns
df.drop(['one','four'],axis = 1,inplace = True)
df

   two  three
a  1.0      1
b  2.0      2
c  3.0      3
d  4.0      4
e  5.0      5
f  NaN      6